# 基础数据类型

# 查看数据类型
# type（）
################################################################################

# 1 数字 > int类
'''
    int（整型）
    long（长整型）（python3中不存在，全都是int）
    float(浮点数)（也就是带小数点的数字）
    complex（复数）（Python还支持复数，复数由实数部分和虚数部分构成，可以用 a + bj,或者 complex(a,b) 表示， 复数的实部 a 和虚部 b 都是浮点型。）
'''
################################################################################
# 2 字符串 > str类
'''
    加上'' 或  ""  或 '''  '''  或""" """都是字符串
    字符串可以相加，字符串拼接
    字符串可以数字相乘 str * int
'''
################################################################################
# 3 布尔值 > bool类
'''
    布尔值只有True（真）和False（假）
'''
################################################################################
# 4 列表 > list类

# 5 元组 > tuple类

# 6 字典 > dict类

# 7 集合 > set类
