# day1-作业
################################################################################

# 1--使用while循环输出1 2 3 4 5 6 7 8 9 10
'''
num = 1
while num <= 10:
    print(num)
    num += 1
'''

################################################################################

# 2--使用while循环输出1 2 3 4 5 6 7 8 9 10 等于7的时候是一个空格
'''
num = 0
while num < 10:
    num += 1
    if num == 7:
        print(' ')
    else:
        print(num)
'''
# 不打印7 方法1
'''
num = 0
while num < 10:
    num += 1
    if num == 7:
        continue
    print(num)
'''
# 不打印7 方法2
'''
num = 0
while num < 10:
    num += 1
    if num == 7:
        pass
    else:
        print(num)
'''

################################################################################

# 3 --求出1-100相加数的和
'''
count = 0
num = 0
while count <= 100:
    num = count + num
    print(num)
    count += 1
'''

################################################################################

# 4 -- 输出1-100内的所有奇数
# 方法1:
'''
count = 1
while count < 101:
    print(count)
    count += 2
'''
# 方法2:
'''
count = 1
while count < 101:
    if count % 2 == 1:
        print(count)
    count += 1
'''

################################################################################

# 5 -- 输出1-100内的所有偶数
'''
count = 1
while count < 101:
    if count % 2 == 0:
        print(count)
    count += 1
'''

################################################################################

# 6 -- 判断用户输入用户名密码(用户名:zhangsan ; 密码:abc123!),正确退出循环打印"登陆成功",三次用户名或密码输入错误退出并打印"您输入的用户名或密码不正确,请重新输入"
'''
count = 1
while count < 4:
    count += 1
    name = input("请输入用户名 ")
    pwd = input("请输入密码: ")
    if name == "zhangsan" and  pwd == "abc123!":
        print("登陆成功")
        break
    else:
        print("您输入的用户名或密码不正确,请重新输入")
        continue
'''