# 列表操作方法
# 列表的增删改查

################################################################################
# 增加 append  # 增加是增加到列表里面

# list1 = ['zhangsan','lisi','wangwu','maliu']
'''
l1 = list1.append('nick')
print(list1)
'''

# 插入 insert  (索引,'要添加的')
'''
l2 = list1.insert(2,'work')
print(list1)
'''

# 迭代添加 extend
'''
l3 = list1.extend('abcd')
print(list1)
l4 = list1.extend([1,2,3])    # int 是不可迭代的 如果想迭代添加 请使用[]
print(list1)
'''

################################################################################

# 删除 pop 按照索引删除
# list2 = ['郭','张','李']
'''
l1 = list2.pop()         # 如果这里不写索引,默认删除最后一个
l2 = list2.pop(1)          # 根据索引删除
print(l2)                  # 返回被删除的
'''

# 按照元素删除
'''
l3 = list2.remove('郭')
print(list2)
'''

# 清空列表
'''
l4 = list2.clear()
print(list2)
'''

# 彻底删除列表,内存中
'''
del list2           也可以切片去删 del list2[0:2]
print(list2)
'''

################################################################################
# 改           #按照索引去改
# list3 = ['章',3,'lisi']
'''
list3[0] = '张'
list3[1] = '一'
print(list3)
'''

# 按照切片去改
'''
list3[0:2] = '张三'
print(list3)
'''

################################################################################

 # 查看列表
# list4 = ['zhangsan','lisi','wangwu','maliu']
'''
l1 = list4[0]      # 按照索引
l2 = list4[0:2]    # 按照切片
print(l1)
print(l2)
'''
# 查看表内所有内容
'''
for i in list4:
    print(i)
'''

################################################################################

# 列表正向排序
# list5 = ['a','c','b','1','3','2']
'''
l1 = list5.sort()
print(list5)
# 倒序排序
l2 = list5.sort(reverse=True)
print(list5)
'''

################################################################################

# 列表嵌套
'''
list6 = ['张三','李四','小明',['123','456']]
print(list6[2][1])
'''

