# dict

# 数据类型划分 : 可变数据类型 , 不可变数据类型
# 不可变数据类型: 元组,布尔,数字 字符串               #可哈希
# 可变数据类型  : 列表, 字典, 集合                   #不可哈希

# dict key 必须是不可变数据类型 , 可哈希
# value: 任意数据类型.
# dict 优点: (1)二分查找  (2)存储大量的关系型数据

dict1 = {1 :'a',2 :'b',3 :'c',4 :'d'}

################################################################################

# 示例1:
# print(dict1)    # 输出结果: {1: 'a', 2: 'b', 3: 'c', 4: 'd'}

################################################################################
# dict 增删改查

# 增
# 方法1
# dict1['5'] = 'e'  # 如果字典里面没有这个键值对增加 , 如果有则值被覆盖
# print(dict1)    #{1: 'a', 2: 'b', 3: 'c', 4: 'd', '5': 'e'}

# 方法2
# dict1.setdefault(6,'f')    # setdefault(key,value)   #有键值对不作任何改变,没有添加
# print(dict1)               # 输出结果 {1: 'a', 2: 'b', 3: 'c', 4: 'd', 6: 'f'}

################################################################################

# 删
# 方法一:
# dict1.pop(1)   # 有返回值 # 按照键去删除(key)
# print(dict1)   # 输出结果 # {2: 'b', 3: 'c', 4: 'd'}
# 如果没有删除的键值
# print(dict1.pop(8,'没有此键'))  # 可以设置提示,如果再删除是不确定有没有此键值

# 方法二:
# dict1.popitem()  # 随机删除 有返回值 返回的是元组
# print(dict1)

# 方法三:
# del dict1[3]
# print(dict1)   # 输出结果: {1: 'a', 2: 'b', 4: 'd'}
# del dict1      # 删除整个字典

# 方法四:
# dict1.clear()    #清空字典
# print(dict1)     # 返回值: {}

